'number' + 3 + 3// виконається конкатенація, бо це строка і додасться до строки 3 і 3 - результат 'number33';

null + 3 // виконається операція 0+3 і результат відображення 3;

5 && "qwerty"//оператор && повертає останнє правдиве значення, оскільки тут обидва правдиве і останнє це стока "qwerty", то результат буде "qwerty";

+'40' + +'2' + "hillel"//унарний плюс доведе числа 40 та 2 до суми, а також потім відбудеться конкатенація зі строкою, результат 42hillel;

'10' - 5 === 6// тут виконається доведення до числового значення у першій частині буде 5 і при порівнянні 5 та 6, де 5 не дорівнює 6 і результатом буде false;

true + false// доведення до числового значення, де true це 1, а false 0, отже результат 1;

'4px' - 3//'4px' не може бути перетворене повністю у число, тому це як результат NaN і при відніманні це не може бути прораховано, тому остаточна відповідь у такому разі поверне NaN;

'4' - 3// виконається математична операція на віднімання у результаті доведення строки у число, результат 1;

'6' + 3 ** 0//результат'61' розрахунок у ступінь на 0 дає 1, далі доведення числа у строку і їх конкатенація;

12 / '6'//2, виконається математична операція на ділення, доведенням строки у число;

'10' + (5 === 6)//'10false' - порівняння 5 і 6 це ложне і конкатинація зі строкою;

null == ''//false - нуль не дорівнює пустій строці;

3 ** (9 / 3)//27 виконається спочатку у дужках математична операція на ділення, далі возведення у ступінь;

!!'false' == !!'true'//true і ліва і права сторона матимуть правдиве значення при виконанні подвійного заперечення, тому у результаті також правда;

0 || '0' && 1//1 - спочатку за пріоритетом оператор && і результат останнє правдиве значення, це 1 і далі АБО, де повертається перше правдиве значення і це 1;

(+null == false) < 1//false - унарний плюс виводить число 0 і це дорівнює при доведенні false у число також 0 і при порівнянні 1 з 1 за результат хибне порівняння;

false && true || true//true - перше хибне повертається при виконанні оператора &&, далі АБО, де повертається перше правдиве значення;

false && (false || true)//false - спочатку дія у дужках і повертається перше правдиве значення у виконанні оператора АБО і далі перше хибне при виконанні оператора &&;

(+null == false) < 1 ** 5//false - унарний плюс доводить до 0 значення null, при порівнянні це дає правдиве значення, бо 0=0, що дорівнює 1 при доведенні, 1 у 5 ступіні 1 і це хибне рівняння як результат;